Revit 2027 API
ParameterTypeId.RbsServiceTypeParam Property
 "Building Service"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsServiceTypeParam { get; }
Public Shared ReadOnly Property RbsServiceTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsServiceTypeParam {
	ForgeTypeId^ get ();
}
static member RbsServiceTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace